
tap 'caskroom/cask'

# Core Homebrew
brew 'aalib'
brew 'ack'
brew 'act'
brew 'adns'
brew 'adwaita-icon-theme'
brew 'afuse'
brew 'agedu'
brew 'alexjs'
brew 'ant'
brew 'antigen'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'asdf'
brew 'aspell'
brew 'assimp'
brew 'astyle'
brew 'atk'
brew 'autoconf'
brew 'autojump'
brew 'automake'
brew 'bat'
brew 'bazel'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'bgrep'
brew 'bingrep'
brew 'binutils'
brew 'black'
brew 'bmon'
brew 'boost'
brew 'boxes'
brew 'bpython'
brew 'brew-pip'
brew 'brotli'
brew 'buildkit'
brew 'bvi'
brew 'c-ares'
brew 'cairo'
brew 'capnp'
brew 'ccache'
brew 'ccze'
brew 'cgrep'
brew 'check'
brew 'chkrootkit'
brew 'clang-format'
brew 'cmake'
brew 'cmatrix'
brew 'confuse'
brew 'coreutils'
brew 'cowsay'
brew 'cpplint'
brew 'cscope'
brew 'ctags'
brew 'ctop'
brew 'curl'
brew 'cvs'
brew 'dart'
brew 'dav1d'
brew 'dbus'
brew 'delta'
brew 'djvulibre'
brew 'dmenu'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker-machine'
brew 'dockutil'
brew 'dos2unix'
brew 'dotnet'
brew 'double-conversion'
brew 'doxygen'
brew 'duckscript'
brew 'e2fsprogs'
brew 'elixir'
brew 'elm'
brew 'enchant'
brew 'erlang'
brew 'eslint'
brew 'evince'
brew 'exa'
brew 'exiv2'
brew 'expat'
brew 'ext2fuse'
brew 'ext4fuse'
brew 'faad2'
brew 'fd'
brew 'fetch'
brew 'ffmpeg'
brew 'fftw'
brew 'figlet'
brew 'findutils'
brew 'flac'
brew 'fluid-synth'
brew 'folderify'
brew 'fontconfig'
brew 'fork-cleaner'
brew 'fortune'
brew 'fping'
brew 'freeglut'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fswatch'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'geeqie'
brew 'gettext'
brew 'gh'
brew 'ghc'
brew 'ghi'
brew 'ghostscript'
brew 'ghq'
brew 'gibo'
brew 'giflib'
brew 'git'
brew 'git-gerrit'
brew 'git-gui'
brew 'git-lfs'
brew 'git-standup'
brew 'git-workspace'
brew 'gitg'
brew 'glib'
brew 'glib-networking'
brew 'global'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-which'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'golangci-lint'
brew 'googletest'
brew 'gpgme'
brew 'gradle'
brew 'grails'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'groovy'
brew 'gsasl'
brew 'gsettings-desktop-schemas'
brew 'gspell'
brew 'gsts'
brew 'gtk+'
brew 'gtk+3'
brew 'gtk-mac-integration'
brew 'gtksourceview3'
brew 'gtkspell3'
brew 'gts'
brew 'guile'
brew 'hadolint'
brew 'harfbuzz'
brew 'haskell-stack'
brew 'helm'
brew 'help2man'
brew 'hexedit'
brew 'hicolor-icon-theme'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'hwloc'
brew 'icu4c'
brew 'ilmbase'
brew 'imagemagick'
brew 'imgpkg'
brew 'imlib2'
brew 'iperf'
brew 'isl'
brew 'iso-codes'
brew 'jasper'
brew 'jemalloc'
brew 'jnettop'
brew 'jpeg'
brew 'jq'
brew 'jvgrep'
brew 'kapp'
brew 'kbld'
brew 'kotlin'
brew 'krb5'
brew 'kscript'
brew 'ktlint'
brew 'kubernetes-cli'
brew 'kwt'
brew 'lame'
brew 'lapack'
brew 'lcov'
brew 'leptonica'
brew 'libao'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libb2'
brew 'libbluray'
brew 'libcaca'
brew 'libdazzle'
brew 'libde265'
brew 'libepoxy'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgee'
brew 'libgit2'
brew 'libgit2-glib'
brew 'libgpg-error'
brew 'libgxps'
brew 'libhandy'
brew 'libheif'
brew 'libice'
brew 'libicns'
brew 'libiconv'
brew 'libid3tag'
brew 'libidn2'
brew 'libksba'
brew 'liblqr'
brew 'libmagic'
brew 'libmaxminddb'
brew 'libmetalink'
brew 'libmpc'
brew 'libmpdclient'
brew 'libnfs'
brew 'libogg'
brew 'libomp'
brew 'libpeas'
brew 'libpng'
brew 'libproxy'
brew 'libpsl'
brew 'libpthread-stubs'
brew 'librsvg'
brew 'libsamplerate'
brew 'libscrypt'
brew 'libsecret'
brew 'libshout'
brew 'libsm'
brew 'libsmi'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoup'
brew 'libsoxr'
brew 'libspectre'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libupnp'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvorbis'
brew 'libvpx'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdamage'
brew 'libxdmcp'
brew 'libxext'
brew 'libxfixes'
brew 'libxft'
brew 'libxi'
brew 'libxinerama'
brew 'libxkbcommon'
brew 'libxmu'
brew 'libxrandr'
brew 'libxrender'
brew 'libxt'
brew 'libxtst'
brew 'libxxf86vm'
brew 'libyaml'
brew 'libzip'
brew 'links'
brew 'little-cms2'
brew 'llvm'
brew 'lua'
brew 'luajit-openresty'
brew 'luarocks'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mackup'
brew 'macvim'
brew 'mailutils'
brew 'mas'
brew 'maven'
brew 'mercurial'
brew 'mesa'
brew 'mesa-glu'
brew 'mesalib-glw'
brew 'midnight-commander'
brew 'moreutils'
brew 'mpd'
brew 'mpdecimal'
brew 'mpfr'
brew 'mr'
brew 'msgpack'
brew 'mtr'
brew 'mupdf'
brew 'mutt'
brew 'mypy'
brew 'mysql'
brew 'mysql-client'
brew 'mysql@5.7'
brew 'mytop'
brew 'ncmpcpp'
brew 'ncurses'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nginx'
brew 'ngrep'
brew 'nim'
brew 'ninja'
brew 'ninvaders'
brew 'nmap'
brew 'node'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'numpy'
brew 'nvm'
brew 'ocaml'
brew 'oniguruma'
brew 'open-mpi'
brew 'openblas'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@11'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@1.1'
brew 'opus'
brew 'p11-kit'
brew 'pandoc'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'pdfgrep'
brew 'perl'
brew 'piksi-firmware-toolchain'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'poet'
brew 'ponysay'
brew 'poppler'
brew 'popt'
brew 'portaudio'
brew 'postgresql'
brew 'powerline-go'
brew 'pqiv'
brew 'pre-commit'
brew 'proctools'
brew 'protobuf'
brew 'proxychains-ng'
brew 'psgrep'
brew 'pssh'
brew 'psutils'
brew 'py3cairo'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pygobject3'
brew 'pyinstaller'
brew 'pylint'
brew 'pypy'
brew 'pypy3'
brew 'pyqt-builder'
brew 'pyside'
brew 'pyside@2'
brew 'python@3.7'
brew 'python@3.8'
brew 'python@3.9'
brew 'qpdf'
brew 'qpm'
brew 'qt'
brew 'qt@5'
brew 'quicktype'
brew 'quilt'
brew 'qwt'
brew 'rav1e'
brew 'rcm'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'ripgrep-all'
brew 'rlwrap'
brew 'rpm'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'rust-analyzer'
brew 's-lang'
brew 's-search'
brew 'saml2aws'
brew 'screenfetch'
brew 'sdl2'
brew 'sgrep'
brew 'shared-mime-info'
brew 'shellcheck'
brew 'shfmt'
brew 'sip'
brew 'sl'
brew 'slurm'
brew 'snappy'
brew 'sngrep'
brew 'socat'
brew 'speedtest-cli'
brew 'speex'
brew 'sphinx'
brew 'sphinx-doc'
brew 'sqlite'
brew 'srt'
brew 'ssh-askpass'
brew 'starship'
brew 'staticcheck'
brew 'stow'
brew 'subversion'
brew 'swig'
brew 'swig@3'
brew 'taglib'
brew 'tal'
brew 'tcl-tk'
brew 'telnet'
brew 'tesseract'
brew 'texinfo'
brew 'the_silver_searcher'
brew 'theora'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'toilet'
brew 'tokyo-cabinet'
brew 'tomcat'
brew 'tor'
brew 'tox'
brew 'travis'
brew 'tree'
brew 'ugrep'
brew 'unbound'
brew 'uncrustify'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'vala'
brew 'vcsh'
brew 'vendir'
brew 'vgrep'
brew 'webp'
brew 'weechat'
brew 'wget'
brew 'wireshark'
brew 'wmctrl'
brew 'wxmac'
brew 'wxpython'
brew 'x264'
brew 'x265'
brew 'xdot'
brew 'xdotool'
brew 'xkeyboardconfig'
brew 'xmlto'
brew 'xorgproto'
brew 'xpdf'
brew 'xvid'
brew 'xz'
brew 'yadm'
brew 'ytt'
brew 'zeromq'
brew 'zimg'
brew 'zsh'
brew 'zsh-async'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-git-prompt'
brew 'zsh-lovers'
brew 'zsh-navigation-tools'
brew 'zsh-syntax-highlighting'
brew 'zsh-you-should-use'
brew 'zshdb'
brew 'zstd'
brew 'zzz'

# Cask Apps
cask 'adoptopenjdk'
cask 'cakebrew'
cask 'docker'
cask 'doteditor'
cask 'dotnet-sdk'
cask 'font-hack-nerd-font'
cask 'font-input'
cask 'font-microsoft-office'
cask 'gitter'
cask 'julia'
cask 'kitty'
cask 'mactex'
cask 'miniconda'
cask 'oracle-jdk'
cask 'osxfuse'
cask 'qt-creator'
cask 'qt-design-studio'
cask 'uncrustifyx'
cask 'virtualbox'
cask 'xquartz'
